{
  "id": 1,
  "address": "",
  "date": "",
  "subject": "Re: ",
  "salutation": "Dear Sir or Madam,",
  "body": "This is xxx. I am writing to apply for the position of Admissions Officer at VCC. Given the job requirements, I believe my current skills can fit this position well.\n\nI am now working as an Admissions Officer in the Registrar Office at University Canada West.\n\nAs long as processing general admission for graduate and undergraduate applications from different countries all over the world, I am mainly responsible for applications from East Asia and South-East Asia region market as a regional coordinator. For applications from the above region market, I am not only responsible for completing the admission eligibility review, but also dealing with correspondences from recruiters and doing research on these countries’ education system and grading scales, in order to generate admissions reports to be used as information resource for both Admissions Officers and applicants to further understand the evaluations of applications from these countries.\n\nAlso, I have worked as a University Lecturer/Instructor for more than 6 years in China. I believe I do have excellent training skills which can absolutely help offer good training to people. I cannot only train people on skills that I have right now, but also on new tasks we might do in the future. Because I am good at generating new/difficult knowledge into simple ways that can be easily understood by people.\n\nWith the excellent organizational skills, I am good at working independently without supervision, balancing competing priorities, paying attention to details and maintaining accuracy. My current supervisor valued me as reliable and trustworthy in my performance review. I do believe I would be a trustworthy member in your team too. I wish you would consider me as a competent and competitive candidate you are looking for. I really appreciate an opportunity to meet you and discuss further my qualification.\n\nThank you very much. I look forward to hearing from you.\n\nSincerely,\nxxx"
}
